OpenFOAM-11/tutorials/incompressibleVoF/floatingObjectWaves/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh

runApplication -s refineMesh.1 topoSet -dict topoSetDict.refineMesh
runApplication -s 2 refineMesh -dict refineMeshDict.1 -overwrite
runApplication -s refineMesh.2 topoSet -dict topoSetDict.refineMesh
runApplication -s 1 refineMesh -dict refineMeshDict.2 -overwrite

runApplication -s floatingObject topoSet -dict topoSetDict.floatingObject
runApplication subsetMesh -overwrite c0 -patch floatingObject -noFields

runApplication setWaves

runApplication $(getApplication)

#------------------------------------------------------------------------------
